force-app/main/default/classes/CheckVersionMockHttpResponse.cls

@isTest
public class CheckVersionMockHttpResponse implements HttpCalloutMock {

    public HTTPResponse respond(HTTPRequest req) {

        HttpResponse res = new HttpResponse();

        res.setBody('<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header></soapenv:Header><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:7:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId>7W3ND73jG5JJ</TrustedId>\n</Login>\n<VersionResponse><ProductVersions><ProductVersion productName="Address Cleansing">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Asia Pacific">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Brazil Premium Content">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Central/South America">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="EMEA">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Exemption Certificate Manager">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Exemption Certificate Portal">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="International Lodging">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Leasing">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Lodging">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="North America - Consumer Use Tax">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="North America - Sales Tax">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Retail">7.0 SR2.14</ProductVersion>\n<ProductVersion productName="Telecom">7.0 SR2.14</ProductVersion>\n</ProductVersions>\n<LibraryVersions><LibraryVersion libraryName="axiom-api.jar" libraryOwner="The Apache Software Foundation">1.2.15-SNAPSHOT</LibraryVersion>\n<LibraryVersion libraryName="javax.el" libraryOwner="Apache Software Foundation">2.2.FR</LibraryVersion>\n<LibraryVersion libraryName="javax.servlet.jsp" libraryOwner="Apache Software Foundation">2.2.FR</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_flexfield_interface" libraryOwner="Vertex Inc">7.0.0.0.3</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_repexp_impl" libraryOwner="Vertex Inc">7.0.2.12.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_xml" libraryOwner="Vertex Inc">7.0.2.8.1</LibraryVersion>\n<LibraryVersion libraryName="jtds.jar">1.2.8</LibraryVersion>\n<LibraryVersion libraryName="Java Runtime Environment" libraryOwner="Oracle Corporation">1.7.0_60</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_certval" libraryOwner="Vertex Inc">7.0.0.0.4</LibraryVersion>\n<LibraryVersion libraryName="catalina-ant.jar" libraryOwner="Apache Software Foundation">7.0.69</LibraryVersion>\n<LibraryVersion libraryName="vertex_webservices" libraryOwner="Vertex Inc">7.0.2.5.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_tax" libraryOwner="Vertex Inc">7.0.0.0.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_vertical" libraryOwner="Vertex Inc">7.0.1.0.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_retail_activity" libraryOwner="Vertex Inc">7.0.2.0.3</LibraryVersion>\n<LibraryVersion libraryName="javax.servlet" libraryOwner="Apache Software Foundation">3.0.FR</LibraryVersion>\n<LibraryVersion libraryName="org.apache.xpath" libraryOwner="Apache Software Foundation">2.7.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_common" libraryOwner="Vertex Inc">7.0.2.8.2</LibraryVersion>\n<LibraryVersion libraryName="commons-codec.jar" libraryOwner="The Apache Software Foundation">1.10</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_calc_impl" libraryOwner="Vertex Inc">7.0.2.14.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_system_userpref" libraryOwner="Vertex Inc">7.0.2.0.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_tmie" libraryOwner="Vertex Inc">7.0.2.13.1</LibraryVersion>\n<LibraryVersion libraryName="spring-beans.jar">4.0.2.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_ccc_interface" libraryOwner="Vertex Inc">7.0.2.4.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_batch_client" libraryOwner="Vertex Inc">7.0.2.14.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps" libraryOwner="Vertex Inc">7.0.2.0.10</LibraryVersion>\n<LibraryVersion libraryName="spring-ws-core.jar">2.2.1.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="dom4j.jar" libraryOwner="MetaStuff Ltd.">1.5.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_calc_interface" libraryOwner="Vertex Inc">7.0.2.11.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_taxgis" libraryOwner="Vertex Inc">7.0.2.0.12</LibraryVersion>\n<LibraryVersion libraryName="spring-web.jar">4.0.2.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="spring-webmvc.jar">4.0.2.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_ccc_impl" libraryOwner="Vertex Inc">7.0.2.13.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_activity_api" libraryOwner="Vertex Inc">7.0.2.0.3</LibraryVersion>\n<LibraryVersion libraryName="vertex_iassist" libraryOwner="Vertex Inc">7.0.2.0.3</LibraryVersion>\n<LibraryVersion libraryName="vertex_util" libraryOwner="Vertex Inc">7.0.2.0.16</LibraryVersion>\n<LibraryVersion libraryName="spring-core.jar">4.0.2.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="vertex_retail_ipc" libraryOwner="Vertex Inc">7.0.2.0.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_registration_validation" libraryOwner="Vertex Inc">7.0.2.0.1</LibraryVersion>\n<LibraryVersion libraryName="org.apache.xml.serializer" libraryOwner="Apache Software Foundation">2.7.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_version" libraryOwner="Vertex Inc">7.0.2.14.3</LibraryVersion>\n<LibraryVersion libraryName="org.apache.xerces.xni" libraryOwner="Apache Software Foundation">1.2</LibraryVersion>\n<LibraryVersion libraryName="vertex_retail_util" libraryOwner="Vertex Inc">7.0.1.0.1</LibraryVersion>\n<LibraryVersion libraryName="spring-xml.jar">2.2.1.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="org.apache.xml.serializer.utils" libraryOwner="Apache Software Foundation">2.7.2</LibraryVersion>\n<LibraryVersion libraryName="spring-context.jar">4.0.2.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_region" libraryOwner="Vertex Inc">7.0.2.2.1</LibraryVersion>\n<LibraryVersion libraryName="javax.websocket" libraryOwner="Apache Software Foundation">1.1.FR</LibraryVersion>\n<LibraryVersion libraryName="vertex_tps_flexfield_impl" libraryOwner="Vertex Inc">7.0.1.0.1</LibraryVersion>\n<LibraryVersion libraryName="bootstrap.jar" libraryOwner="Apache Software Foundation">7.0.69</LibraryVersion>\n<LibraryVersion libraryName="spring-aop.jar">4.0.2.RELEASE</LibraryVersion>\n<LibraryVersion libraryName="vertex_taxassist" libraryOwner="Vertex Inc">7.0.2.7.1</LibraryVersion>\n<LibraryVersion libraryName="vertex_retail_tax_extract" libraryOwner="Vertex Inc">7.0.2.13.1</LibraryVersion>\n<LibraryVersion libraryName="spring-expression.jar">4.0.2.RELEASE</LibraryVersion>\n</LibraryVersions>\n<DatabaseVersions><DatabaseVersion logicalName="RPT_DB"><SchemaVersion>7.0.0001</SchemaVersion>\n<PlatformVersion vendorName="microsoft sql server">11.00.2100</PlatformVersion>\n<DriverVersion driverName="jtds type 4 jdbc driver for ms sql server and sybase">1.2.8</DriverVersion>\n</DatabaseVersion>\n<DatabaseVersion logicalName="JOURNAL_DB"><SchemaVersion>7.0.0001</SchemaVersion>\n<PlatformVersion vendorName="microsoft sql server">11.00.2100</PlatformVersion>\n<DriverVersion driverName="jtds type 4 jdbc driver for ms sql server and sybase">1.2.8</DriverVersion>\n</DatabaseVersion>\n<DatabaseVersion logicalName="TAXGIS_DB"><SchemaVersion>7.0.0001</SchemaVersion>\n<PlatformVersion vendorName="microsoft sql server">11.00.2100</PlatformVersion>\n<DriverVersion driverName="jtds type 4 jdbc driver for ms sql server and sybase">1.2.8</DriverVersion>\n<DataContentVersions><DataContentVersion contentName="taxgis:Global GIS">160.0 (DELTA)</DataContentVersion>\n</DataContentVersions>\n</DatabaseVersion>\n<DatabaseVersion logicalName="TPS_DB"><SchemaVersion>7.0.0001</SchemaVersion>\n<PlatformVersion vendorName="microsoft sql server">11.00.2100</PlatformVersion>\n<DriverVersion driverName="jtds type 4 jdbc driver for ms sql server and sybase">1.2.8</DriverVersion>\n<DataContentVersions><DataContentVersion contentName="tps:LEASE">160.0 (DELTA)</DataContentVersion>\n<DataContentVersion contentName="tps:STANDARD">160.0 (DELTA)</DataContentVersion>\n</DataContentVersions>\n</DatabaseVersion>\n<DatabaseVersion logicalName="UTIL_DB"><SchemaVersion>7.0.0001</SchemaVersion>\n<PlatformVersion vendorName="microsoft sql server">11.00.2100</PlatformVersion>\n<DriverVersion driverName="jtds type 4 jdbc driver for ms sql server and sybase">1.2.8</DriverVersion>\n<DataContentVersions><DataContentVersion contentName="util:Utility">160.0 (DELTA)</DataContentVersion>\n</DataContentVersions>\n</DatabaseVersion>\n</DatabaseVersions>\n<OperatingSystemVersion operatingSystemName="Windows Server 2012">6.2</OperatingSystemVersion>\n<JavaVirtualMachineVersion jvmName="Java(TM) SE Runtime Environment">1.7.0_60</JavaVirtualMachineVersion>\n<ServerInformation><ServerDetail serverDetailName="UpTime">133 days 14 hours 38 minutes 43 seconds</ServerDetail>\n</ServerInformation>\n<DataManagementActivities><DataManagementActivity activityName="Tax Data Import"><StartTime>2017-05-18T01:01:59</StartTime>\n<EndTime>2017-05-18T01:02:04</EndTime>\n<Status>Completed with warning</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Import"><StartTime>2017-05-18T00:33:39</StartTime>\n<EndTime>2017-05-18T00:33:46</EndTime>\n<Status>Completed with failure</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-05-18T00:20:02</StartTime>\n<EndTime>2017-05-18T00:20:04</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-05-16T00:01:37</StartTime>\n<EndTime>2017-05-16T00:01:39</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Import"><StartTime>2017-05-15T13:41:40</StartTime>\n<EndTime>2017-05-15T13:41:44</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-05-10T01:46:30</StartTime>\n<EndTime>2017-05-10T01:46:31</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-05-10T01:35:04</StartTime>\n<EndTime>2017-05-10T01:35:06</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-04-20T19:04:58</StartTime>\n<EndTime>2017-04-20T19:04:59</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-04-20T18:48:26</StartTime>\n<EndTime>2017-04-20T18:48:27</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n<DataManagementActivity activityName="Tax Data Export"><StartTime>2017-04-20T18:43:32</StartTime>\n<EndTime>2017-04-20T18:43:33</EndTime>\n<Status>Completed successfully</Status>\n</DataManagementActivity>\n</DataManagementActivities>\n<ConfigFileOverrides><ConfigFileOverride parameterName="AllowHistoricalEdits">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="common.fw.rba.EnableTrusted">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="taxgis.jurisdictionfinder.AddressCleansingProcessingOrder">CALL_ADDRESS_CLEANSING_FIRST</ConfigFileOverride>\n<ConfigFileOverride parameterName="taxgis.jurisdictionfinder.ContinueIfAddressCleansingUnavailable">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="taxgis.jurisdictionfinder.RetrieveCleansedAddress">FULL</ConfigFileOverride>\n<ConfigFileOverride parameterName="taxgis.jurisdictionfinder.ToRetrieveAddressCleansingSecondStreetLine">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="taxgis.jurisdictionfinder.ToRetrieveFullVertexAddresses">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="taxgis.jurisdictionfinder.ToUseAddressCleansing">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="tps.common.domain.TransactionDump">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="tps.sutax.trtest.ShowTaxJournalButton">true</ConfigFileOverride>\n<ConfigFileOverride parameterName="util.db.JdbcDriverName">net.sourceforge.jtds.jdbc.Driver</ConfigFileOverride>\n<ConfigFileOverride parameterName="vertex_taxgis_schema">dbo</ConfigFileOverride>\n</ConfigFileOverrides>\n</VersionResponse>\n<ApplicationData><ResponseTimeMS>33.4</ResponseTimeMS>\n</ApplicationData>\n</VertexEnvelope></soapenv:Body></soapenv:Envelope>');
        res.setStatusCode(200);

        System.assert(res.getBody() != null);

        return res;
    }

}